app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("mfg_company", "car_model", "mfg_year", "car_description", "horse_power", "top_speed", "created_at", "updated_at", "transmission", "drive_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @car.update(car_params)
---
UPDATE "cars" SET "car_model" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["car_model", "MG Hector Centura"], ["updated_at", "2024-09-27 12:53:41.560262"], ["id", 3]]

  def costly_cars
    @costly_cars = Car.where('car_price >= ?', 20.0)
---
SELECT "cars".* FROM "cars" WHERE (car_price >= 20.0)