app/views/cars/costly_cars.html.erb

    <div class="card" style="width: 18rem; height: 28rem; margin: 10px;">
      <%= image_tag car.images.first, class: "card-img-top",  style: "height: 150px;", alt: car.car_model if car.images.attached? %>
---
SELECT "cars".* FROM "cars" WHERE (car_price >= 20.0)